# Importing Data
## What we need

In [12]:
#both pandas (alias as pd) and os are libraries of python
#pandas library to read .csv files
import pandas as pd
#os for the ease of loading the directrory by corss platform, e.g. windows, macos
import os

## Method 1: the simplest way:  
### **pros:**
- easy to type
- easy to read  

### **cons:**
- os dependent (to solve this, see Method 2 below)

In [10]:
df_method_1 = pd.read_csv("data.csv")
df_method_1.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Method 2: the fancy way
### aka making every windows and mac users happy :)

**Disclaimer:**  
I learnt this from the youtube channel: Shashank Kalanithi,  
https://www.youtube.com/user/95shawshankk19.

In [20]:
#Step 1: get the present working directory (pwd) using this line of code
pwd = os.getcwd()

#Step 2: joining the present working directory with the filename you want to work on
data = os.path.join(pwd, "data.csv")

#Step 3: use pd.read_csv() just like Method 1
df_method_2 = pd.read_csv(data)

#Step 4: show part the data
df_method_2.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S